src/main/resources/xml/accommodationFulfillmentServicePort/updateLateCheckOutStatus/updateLateCheckOutStatus.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:updateLateCheckOutStatus>
         <request>
            <!--Zero or more repetitions:-->
            <statusChangeList>
               <travelPlanId>?</travelPlanId>
               <travelComponentId>?</travelComponentId>
               <travelComponentServiceRequestId>?</travelComponentServiceRequestId>
               <!--Optional:-->
               <newStatus>?</newStatus>
               <!--Optional:-->
               <statusChangeReason>?</statusChangeReason>
               <!--Optional:-->
               <lateCheckOutRequestDetail>
                  <!--Optional:-->
                  <requestedDateTime>?</requestedDateTime>
                  <!--Optional:-->
                  <reasonForLateCheckOut>?</reasonForLateCheckOut>
                  <!--Optional:-->
                  <feeWaived>?</feeWaived>
                  <!--Optional:-->
                  <feeWaiveReason>?</feeWaiveReason>
               </lateCheckOutRequestDetail>
            </statusChangeList>
            <!--Optional:-->
            <locationId>?</locationId>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:updateLateCheckOutStatus>
   </soapenv:Body>
</soapenv:Envelope>
